## Feature Encoding

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import preprocessing

In [7]:
df = pd.read_csv('Churn_Modelling.csv')

In [3]:
df.head(5)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42.0,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41.0,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42.0,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39.0,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43.0,2,125510.82,1,1,1,79084.10,0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           9755 non-null   object
 6   Age              9713 non-null   float64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(3), int64(8), object(3)
memory usage: 1.1+ MB

In [8]:
# Get rid of irrelevant columns
df.drop(columns = ["CustomerId", "RowNumber", "Surname"], axis = 1, inplace=True)

In [9]:
df.head(5)

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42.0,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41.0,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42.0,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39.0,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43.0,2,125510.82,1,1,1,79084.10,0

In [10]:
df.Gender.value_counts()

Gender
Male      5325
Female    4430
Name: count, dtype: int64

#### Handling missing values in Gender

In [ ]:
# find the mode
df.Gender.mode()

# fill the missing values with mode
df['Gender'] = df['Gender'].fillna('Male')

# see the male stats increase
df.Gender.value_counts()

Gender
Male      5570
Female    4430
Name: count, dtype: int64

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CreditScore      10000 non-null  int64
 1   Geography        10000 non-null  object
 2   Gender           10000 non-null  object
 3   Age              9713 non-null   float64
 4   Tenure           10000 non-null  int64
 5   Balance          10000 non-null  float64
 6   NumOfProducts    10000 non-null  int64
 7   HasCrCard        10000 non-null  int64
 8   IsActiveMember   10000 non-null  int64
 9   EstimatedSalary  10000 non-null  float64
 10  Exited           10000 non-null  int64
dtypes: float64(3), int64(6), object(2)
memory usage: 859.5+ KB

#### Label Encoding

In [15]:
# Give 'Male' a 0 and 'Female' a 1; or locations a 1,2,3... even though this is not recommended.

# sklearn preprocessor to Label Encoder. only used for Y variables

le = preprocessing.LabelEncoder()
df['Gender_label'] = le.fit_transform(df.Gender.values)

In [ ]:
# see a new created column of Gender_label
df.head(10)

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Gender_label
0,619,France,Female,42.000000,2,0.00,1,1,1,101348.88,1,0
1,608,Spain,Female,41.000000,1,83807.86,1,0,1,112542.58,0,0
2,502,France,Female,42.000000,8,159660.80,3,1,0,113931.57,1,0
3,699,France,Female,39.000000,1,0.00,2,0,0,93826.63,0,0
4,850,Spain,Female,43.000000,2,125510.82,1,1,1,79084.10,0,0
5,645,Spain,Male,44.000000,8,113755.78,2,1,0,149756.71,1,1
6,822,France,Male,50.000000,7,0.00,2,1,1,10062.80,0,1
7,376,Germany,Female,29.000000,4,115046.74,4,1,0,119346.88,1,0
8,501,France,Male,44.000000,4,142051.07,2,0,1,74940.50,0,1
9,684,France,Male,38.911905,2,134603.88,1,1,1,71725.73,0,1

#### One Hot Encoding

In [ ]:
# Spain, Germany, France... create 3 new label columns
# Loc_Spain.  Loc_Germany.  Loc_France
#    1.           0             0
#    0.           0             1
#    0.           1             0
#    0.           0             1

In [ ]:
# pandas.get_dummies.  OR
# sklearn.preprocessing.OneHotEncoder

In [21]:
one_hot = pd.get_dummies(df['Geography'])
one_hot

      France  Germany  Spain
0       True    False  False
1      False    False   True
2       True    False  False
3       True    False  False
4      False    False   True
...      ...      ...    ...
9995    True    False  False
9996    True    False  False
9997    True    False  False
9998   False     True  False
9999    True    False  False

[10000 rows x 3 columns]

In [23]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Gender_label
0,619,France,Female,42.0,2,0.00,1,1,1,101348.88,1,0
1,608,Spain,Female,41.0,1,83807.86,1,0,1,112542.58,0,0
2,502,France,Female,42.0,8,159660.80,3,1,0,113931.57,1,0
3,699,France,Female,39.0,1,0.00,2,0,0,93826.63,0,0
4,850,Spain,Female,43.0,2,125510.82,1,1,1,79084.10,0,0

#### Dummy Encoding

In [24]:
df_dummies = pd.get_dummies(df)

df_dummies.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Gender_label,Geography_France,Geography_Germany,Geography_Spain,Gender_Female,Gender_Male
0,619,42.0,2,0.00,1,1,1,101348.88,1,0,True,False,False,True,False
1,608,41.0,1,83807.86,1,0,1,112542.58,0,0,False,False,True,True,False
2,502,42.0,8,159660.80,3,1,0,113931.57,1,0,True,False,False,True,False
3,699,39.0,1,0.00,2,0,0,93826.63,0,0,True,False,False,True,False
4,850,43.0,2,125510.82,1,1,1,79084.10,0,0,False,False,True,True,False

In [ ]:
# Dummy Encoding

df_dummies_de = pd.get_dummies(df, drop_first=True)
df_dummies_de.head()

# now one of the 3 Geography fields are removed. because this is redundant

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Gender_label,Geography_Germany,Geography_Spain,Gender_Male
0,619,42.0,2,0.00,1,1,1,101348.88,1,0,False,False,False
1,608,41.0,1,83807.86,1,0,1,112542.58,0,0,False,True,False
2,502,42.0,8,159660.80,3,1,0,113931.57,1,0,False,False,False
3,699,39.0,1,0.00,2,0,0,93826.63,0,0,False,False,False
4,850,43.0,2,125510.82,1,1,1,79084.10,0,0,False,True,False

#### Target Encoding

In [26]:
pip install category_encoders

Collecting category_encoders
  Downloading category_encoders-2.8.1-py3-none-any.whl.metadata (7.9 kB)
Requirement already satisfied: numpy>=1.14.0 in /Users/stevesimonson/development/tutorials/PythonforDS/.venv/lib/python3.12/site-packages (from category_encoders) (2.3.2)
Requirement already satisfied: pandas>=1.0.5 in /Users/stevesimonson/development/tutorials/PythonforDS/.venv/lib/python3.12/site-packages (from category_encoders) (2.3.2)
Collecting patsy>=0.5.1 (from category_encoders)
  Downloading patsy-1.0.1-py2.py3-none-any.whl.metadata (3.3 kB)
Requirement already satisfied: scikit-learn>=1.6.0 in /Users/stevesimonson/development/tutorials/PythonforDS/.venv/lib/python3.12/site-packages (from category_encoders) (1.7.2)
Requirement already satisfied: scipy>=1.0.0 in /Users/stevesimonson/development/tutorials/PythonforDS/.venv/lib/python3.12/site-packages (from category_encoders) (1.16.2)
Collecting statsmodels>=0.9.0 (from category_encoders)
  Downloading statsmodels-0.14.5-cp312-cp312-macosx_11_0_arm64.whl.metadata (9.5 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/stevesimonson/development/tutorials/PythonforDS/.venv/lib/python3.12/site-packages (from pandas>=1.0.5->category_encoders) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/stevesimonson/development/tutorials/PythonforDS/.venv/lib/python3.12/site-packages (from pandas>=1.0.5->category_encoders) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /Users/stevesimonson/development/tutorials/PythonforDS/.venv/lib/python3.12/site-packages (from pandas>=1.0.5->category_encoders) (2025.2)
Requirement already satisfied: six>=1.5 in /Users/stevesimonson/development/tutorials/PythonforDS/.venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas>=1.0.5->category_encoders) (1.17.0)
Requirement already satisfied: joblib>=1.2.0 in /Users/stevesimonson/development/tutorials/PythonforDS/.venv/lib/python3.12/site-packages (from scikit-learn>=1.6.0->category_encoders) (1.5.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in /Users/stevesimonson/development/tutorials/PythonforDS/.venv/lib/python3.12/site-packages (from scikit-learn>=1.6.0->category_encoders) (3.6.0)
Requirement already satisfied: packaging>=21.3 in /Users/stevesimonson/development/tutorials/PythonforDS/.venv/lib/python3.12/site-packages (from statsmodels>=0.9.0->category_encoders) (25.0)
Downloading category_encoders-2.8.1-py3-none-any.whl (85 kB)
Downloading patsy-1.0.1-py2.py3-none-any.whl (232 kB)
Downloading statsmodels-0.14.5-cp312-cp312-macosx_11_0_arm64.whl (9.7 MB)
   â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â” 9.7/9.7 MB 60.4 MB/s  0:00:00
Installing collected packages: patsy, statsmodels, category_encoders
   â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â” 3/3 [category_encoders]statsmodels]
Successfully installed category_encoders-2.8.1 patsy-1.0.1 statsmodels-0.14.5
Note: you may need to restart the kernel to use updated packages.

In [27]:
from category_encoders import TargetEncoder

encoder = TargetEncoder()

In [30]:
df1 = pd.read_csv('Churn_Modelling.csv')
df1.drop(columns = ["CustomerId", "RowNumber", "Surname"], axis = 1, inplace=True)
df1['Gender'] = df1['Gender'].fillna('Male')

In [ ]:
df1.head()

In [33]:
df1['Gender Encoded'] = encoder.fit_transform(df1['Gender'], df1['Exited'])

In [34]:
df1.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Gender Encoded
0,619,France,Female,42.0,2,0.00,1,1,1,101348.88,1,0.251919
1,608,Spain,Female,41.0,1,83807.86,1,0,1,112542.58,0,0.251919
2,502,France,Female,42.0,8,159660.80,3,1,0,113931.57,1,0.251919
3,699,France,Female,39.0,1,0.00,2,0,0,93826.63,0,0.251919
4,850,Spain,Female,43.0,2,125510.82,1,1,1,79084.10,0,0.251919

In [35]:
df1['Gender Encoded'].value_counts()

Gender Encoded
0.165350    5570
0.251919    4430
Name: count, dtype: int64

#### Benefits of TE:

- Target encoding is a simple and quick encoding method that doesn't add to the dimensionality of the dataset. Therefore, it may be used as a good first try technique

#### Limitations of TE:

- It is dependent on the target distribution which means target encoding requires careful validation as it can be prone to overfitting.

#### Hash Encoding

In [39]:
from category_encoders import HashingEncoder

In [41]:
x = df.Gender
y = df.Exited

In [42]:
ce_hash = HashingEncoder(cols = ['Gender'])
ce_hash.fit_transform(x, y)

      col_0  col_1  col_2  col_3  col_4  col_5  col_6  col_7
0         0      0      0      0      0      0      0      1
1         0      0      0      0      0      0      0      1
2         0      0      0      0      0      0      0      1
3         0      0      0      0      0      0      0      1
4         0      0      0      0      0      0      0      1
...     ...    ...    ...    ...    ...    ...    ...    ...
9995      0      0      0      0      0      1      0      0
9996      0      0      0      0      0      1      0      0
9997      0      0      0      0      0      0      0      1
9998      0      0      0      0      0      1      0      0
9999      0      0      0      0      0      0      0      1

[10000 rows x 8 columns]

In [43]:
x = df.Geography

In [ ]:
ce_hash2 = HashingEncoder(cols = ['Geography'])
ce_hash2.fit_transform(x, y)

# by default creates 8 columns. you can change the n_components to as many as you want.
# what this does I don't know!!!

      col_0  col_1  col_2  col_3  col_4  col_5  col_6  col_7
0         0      1      0      0      0      0      0      0
1         0      0      0      1      0      0      0      0
2         0      1      0      0      0      0      0      0
3         0      1      0      0      0      0      0      0
4         0      0      0      1      0      0      0      0
...     ...    ...    ...    ...    ...    ...    ...    ...
9995      0      1      0      0      0      0      0      0
9996      0      1      0      0      0      0      0      0
9997      0      1      0      0      0      0      0      0
9998      0      0      0      0      0      0      0      1
9999      0      1      0      0      0      0      0      0

[10000 rows x 8 columns]